In [23]:
# @title
from IPython.display import display, HTML

display(HTML("""
<script>
const firstCell = document.querySelector('.cell.code_cell');
if (firstCell) {
  firstCell.querySelector('.input').style.pointerEvents = 'none';
  firstCell.querySelector('.input').style.opacity = '0.5';
}
</script>
"""))

html = """
<div style="display:flex; flex-direction:column; align-items:center; text-align:center; gap:12px; padding:8px;">
  <h1 style="margin:0;">ðŸ‘‹ Welcome to <span style="color:#1E88E5;">Algopath Coding Academy</span>!</h1>

  <img src="https://raw.githubusercontent.com/sshariqali/mnist_pretrained_model/main/algopath_logo.jpg"
       alt="Algopath Coding Academy Logo"
       width="400"
       style="border-radius:15px; box-shadow:0 4px 12px rgba(0,0,0,0.2); max-width:100%; height:auto;" />

  <p style="font-size:16px; margin:0;">
    <em>Empowering young minds to think creatively, code intelligently, and build the future with AI.</em>
  </p>
</div>
"""

display(HTML(html))

### **What is Pandas?**

Welcome to this complete guide to Pandas - Python's most powerful data analysis library!

**Table of Contents:**
1. [Introduction to Pandas](#1)
2. [Creating Pandas Objects](#2)
3. [Basic DataFrame Inspection](#3)
4. [Indexing and Selection](#4)
5. [Filtering with Logical Conditions](#5)
6. [Assigning and Modifying Data](#6)
7. [Cleaning & Aggregation](#7)
8. [Advanced Topics](#8)

* * *

<a name='1'></a>
## **1. Introduction to Pandas**

### What is Pandas?

Pandas is an open-source Python library that provides high-performance, easy-to-use data structures and data analysis tools. It's built on top of NumPy and is essential for:
- Data cleaning and preparation
- Data analysis and exploration
- Time series analysis
- Statistical analysis

### Core Data Structures

Pandas has two primary data structures:
- **Series**: 1-dimensional labeled array (like a column in Excel)
- **DataFrame**: 2-dimensional labeled data structure (like a spreadsheet or SQL table)

### Importing Pandas

In [2]:
# Standard convention for importing Pandas
import pandas as pd
import numpy as np

# Check version
print(f"Pandas version: {pd.__version__}")

Pandas version: 2.3.3

---
<a name='2'></a>
## **2. Creating Pandas Objects**

### Creating a Series

In [6]:
# Creating a Series from a list
series_from_list = pd.Series([10, 20, 30, 40, 50])
series_from_list

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
type(series_from_list)

pandas.core.series.Series

In [7]:
# Creating a Series from a dictionary
series_from_dict = pd.Series({
    'Apple': 5,
    'Banana': 3,
    'Orange': 7,
    'Mango': 2
})
series_from_dict

Apple     5
Banana    3
Orange    7
Mango     2
dtype: int64

### Creating a DataFrame

In [8]:
# Creating a DataFrame from a dictionary of lists
data_dict = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['New York', 'Paris', 'London', 'Tokyo', 'Berlin'],
    'Salary': [70000, 80000, 75000, 90000, 85000]
}

df = pd.DataFrame(data_dict)
df

      Name  Age      City  Salary
0    Alice   25  New York   70000
1      Bob   30     Paris   80000
2  Charlie   35    London   75000
3    Diana   28     Tokyo   90000
4      Eve   32    Berlin   85000

In [9]:
# Creating a DataFrame from a list of dictionaries
list_of_dicts = [
    {'Product': 'Laptop', 'Price': 1200, 'Stock': 15},
    {'Product': 'Mouse', 'Price': 25, 'Stock': 50},
    {'Product': 'Keyboard', 'Price': 75, 'Stock': 30},
    {'Product': 'Monitor', 'Price': 300, 'Stock': 20}
]

df_products = pd.DataFrame(list_of_dicts)
df_products

    Product  Price  Stock
0    Laptop   1200     15
1     Mouse     25     50
2  Keyboard     75     30
3   Monitor    300     20

### Loading Data from a File

In [ ]:
# Loading data from CSV file
df_employees = pd.read_csv('employees.csv')

df_employees

            Name  Age   Department  Salary    JoinDate
0     John Smith   28  Engineering   95000  2020-01-15
1  Sarah Johnson   34    Marketing   82000  2019-05-22
2  Michael Brown   31  Engineering   98000  2018-11-10
3    Emily Davis   29           HR   72000  2021-03-08
4   David Wilson   42   Management  120000  2015-07-19
5  Lisa Anderson   26    Marketing   68000  2022-01-25
6   James Taylor   38  Engineering  105000  2017-09-14

---
<a name='3'></a>
## **3. Basic DataFrame Inspection**

### Viewing Data

In [11]:
# View first few rows (default is 5)
df_employees.head(3)

            Name  Age   Department  Salary    JoinDate
0     John Smith   28  Engineering   95000  2020-01-15
1  Sarah Johnson   34    Marketing   82000  2019-05-22
2  Michael Brown   31  Engineering   98000  2018-11-10

In [12]:
# View last few rows
df_employees.tail(2)

            Name  Age   Department  Salary    JoinDate
5  Lisa Anderson   26    Marketing   68000  2022-01-25
6   James Taylor   38  Engineering  105000  2017-09-14

### Getting DataFrame Information

In [13]:
# Get concise summary of the DataFrame
df_employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        7 non-null      object
 1   Age         7 non-null      int64
 2   Department  7 non-null      object
 3   Salary      7 non-null      int64
 4   JoinDate    7 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [14]:
# Get statistical summary
df_employees.describe()

             Age         Salary
count   7.000000       7.000000
mean   32.571429   91428.571429
std     5.769377   18581.865199
min    26.000000   68000.000000
25%    28.500000   77000.000000
50%    31.000000   95000.000000
75%    36.000000  101500.000000
max    42.000000  120000.000000

### Essential Attributes

In [15]:
# Shape: number of rows and columns
df_employees.shape

(7, 5)

In [16]:
# Column names
df_employees.columns

Index(['Name', 'Age', 'Department', 'Salary', 'JoinDate'], dtype='object')

In [17]:
# Index
df_employees.index

RangeIndex(start=0, stop=7, step=1)

In [18]:
# Data types
df_employees.dtypes

Name          object
Age            int64
Department    object
Salary         int64
JoinDate      object
dtype: object

---
<a name='4'></a>
## **4. Indexing and Selection**

### Selecting Columns

In [19]:
# Select a single column (returns a Series)
df_employees['Name']

0       John Smith
1    Sarah Johnson
2    Michael Brown
3      Emily Davis
4     David Wilson
5    Lisa Anderson
6     James Taylor
Name: Name, dtype: object

In [20]:
type(df_employees['Name'])

pandas.core.series.Series

In [21]:
# Select multiple columns (returns a DataFrame)
df_employees[['Name', 'Age', 'Salary']]

            Name  Age  Salary
0     John Smith   28   95000
1  Sarah Johnson   34   82000
2  Michael Brown   31   98000
3    Emily Davis   29   72000
4   David Wilson   42  120000
5  Lisa Anderson   26   68000
6   James Taylor   38  105000

In [22]:
type(df_employees[['Name', 'Age', 'Salary']])

pandas.core.frame.DataFrame

### .iloc - Integer-position Based Selection

Use `.iloc` for selecting by integer position (like array indexing).

In [23]:
# Select a single row by position

df_employees.iloc[0]

Name           John Smith
Age                    28
Department    Engineering
Salary              95000
JoinDate       2020-01-15
Name: 0, dtype: object

In [24]:
# Select multiple rows

df_employees.iloc[1:4]

            Name  Age   Department  Salary    JoinDate
1  Sarah Johnson   34    Marketing   82000  2019-05-22
2  Michael Brown   31  Engineering   98000  2018-11-10
3    Emily Davis   29           HR   72000  2021-03-08

In [25]:
# Select specific rows and columns

df_employees.iloc[0:3, 0:3]

            Name  Age   Department
0     John Smith   28  Engineering
1  Sarah Johnson   34    Marketing
2  Michael Brown   31  Engineering

### .loc - Label-based Selection

Use `.loc` for selecting by labels (index and column names).

In [26]:
# Select row by label (index)

df_employees.loc[2]

Name          Michael Brown
Age                      31
Department      Engineering
Salary                98000
JoinDate         2018-11-10
Name: 2, dtype: object

In [27]:
# Select specific rows and columns by label

df_employees.loc[0:2, ['Name', 'Department', 'Salary']]

            Name   Department  Salary
0     John Smith  Engineering   95000
1  Sarah Johnson    Marketing   82000
2  Michael Brown  Engineering   98000

In [28]:
# Select all rows, specific columns

df_employees.loc[:, ['Name', 'Age']]

            Name  Age
0     John Smith   28
1  Sarah Johnson   34
2  Michael Brown   31
3    Emily Davis   29
4   David Wilson   42
5  Lisa Anderson   26
6   James Taylor   38

---
<a name='5'></a>
## **5. Filtering with Logical Conditions**

### Boolean Masks

In [30]:
# Create a boolean mask
age_mask = df_employees['Age'] > 30
age_mask

0    False
1     True
2     True
3    False
4     True
5    False
6     True
Name: Age, dtype: bool

In [31]:
type(age_mask)

pandas.core.series.Series

### Filtering with Single Conditions

In [32]:
# Filter employees older than 30

df_employees[df_employees['Age'] > 30]

            Name  Age   Department  Salary    JoinDate
1  Sarah Johnson   34    Marketing   82000  2019-05-22
2  Michael Brown   31  Engineering   98000  2018-11-10
4   David Wilson   42   Management  120000  2015-07-19
6   James Taylor   38  Engineering  105000  2017-09-14

In [33]:
# Filter by department

df_employees[df_employees['Department'] == 'Engineering']

            Name  Age   Department  Salary    JoinDate
0     John Smith   28  Engineering   95000  2020-01-15
2  Michael Brown   31  Engineering   98000  2018-11-10
6   James Taylor   38  Engineering  105000  2017-09-14

### Filtering with Multiple Conditions

Use `&` for AND and `|` for OR. **Important:** Use parentheses around each condition!

In [34]:
# AND condition: Age > 30 AND Salary > 90000

df_employees[(df_employees['Age'] > 30) & (df_employees['Salary'] > 90000)]

            Name  Age   Department  Salary    JoinDate
2  Michael Brown   31  Engineering   98000  2018-11-10
4   David Wilson   42   Management  120000  2015-07-19
6   James Taylor   38  Engineering  105000  2017-09-14

In [35]:
# OR condition: Department is Engineering OR Marketing

df_employees[(df_employees['Department'] == 'Engineering') | (df_employees['Department'] == 'Marketing')]

            Name  Age   Department  Salary    JoinDate
0     John Smith   28  Engineering   95000  2020-01-15
1  Sarah Johnson   34    Marketing   82000  2019-05-22
2  Michael Brown   31  Engineering   98000  2018-11-10
5  Lisa Anderson   26    Marketing   68000  2022-01-25
6   James Taylor   38  Engineering  105000  2017-09-14

### Filtering with .isin()

Use `.isin()` to filter based on a list of values.

In [36]:
# Filter employees in specific departments

departments_of_interest = ['Engineering', 'HR', 'Management']
df_employees[df_employees['Department'].isin(departments_of_interest)]

            Name  Age   Department  Salary    JoinDate
0     John Smith   28  Engineering   95000  2020-01-15
2  Michael Brown   31  Engineering   98000  2018-11-10
3    Emily Davis   29           HR   72000  2021-03-08
4   David Wilson   42   Management  120000  2015-07-19
6   James Taylor   38  Engineering  105000  2017-09-14

---
<a name='6'></a>
## **6. Assigning and Modifying Data**

### Creating New Columns

In [37]:
# Create a copy to avoid modifying the original
df_modified = df_employees.copy()

In [38]:
# Add a column with a scalar value
df_modified['Country'] = 'USA'

In [39]:
# Add a column based on calculations from other columns
df_modified['Annual_Bonus'] = df_modified['Salary'] * 0.10

In [40]:
# Add a column based on conditions
df_modified['Seniority'] = df_modified['Age'].apply(lambda x: 'Senior' if x >= 35 else 'Junior')

In [42]:
df_modified

,Name,Age,Department,Salary,JoinDate,Country,Annual_Bonus,Seniority
0,John Smith,28,Engineering,95000,2020-01-15,USA,9500.0,Junior
1,Sarah Johnson,34,Marketing,82000,2019-05-22,USA,8200.0,Junior
2,Michael Brown,31,Engineering,98000,2018-11-10,USA,9800.0,Junior
3,Emily Davis,29,HR,72000,2021-03-08,USA,7200.0,Junior
4,David Wilson,42,Management,120000,2015-07-19,USA,12000.0,Senior
5,Lisa Anderson,26,Marketing,68000,2022-01-25,USA,6800.0,Junior
6,James Taylor,38,Engineering,105000,2017-09-14,USA,10500.0,Senior

### Modifying Data Using .loc

In [43]:
# Modify a specific cell
df_modified.loc[0, 'Salary'] = 100000
df_modified.head(3)

,Name,Age,Department,Salary,JoinDate,Country,Annual_Bonus,Seniority
0,John Smith,28,Engineering,100000,2020-01-15,USA,9500.0,Junior
1,Sarah Johnson,34,Marketing,82000,2019-05-22,USA,8200.0,Junior
2,Michael Brown,31,Engineering,98000,2018-11-10,USA,9800.0,Junior

In [44]:
# Modify multiple rows based on condition
df_modified.loc[df_modified['Department'] == 'Marketing', 'Annual_Bonus'] = 15000
df_modified[df_modified['Department'] == 'Marketing']

,Name,Age,Department,Salary,JoinDate,Country,Annual_Bonus,Seniority
1,Sarah Johnson,34,Marketing,82000,2019-05-22,USA,15000.0,Junior
5,Lisa Anderson,26,Marketing,68000,2022-01-25,USA,15000.0,Junior

### âš ï¸ Warning: Chained Indexing

Chained indexing can lead to unexpected behavior. Always use `.loc` or `.iloc` for assignments.

In [ ]:
# BAD: Chained indexing (may not work as expected)
# df_modified[df_modified['Age'] > 30]['Salary'] = 100000  # Don't do this!

# GOOD: Using .loc
df_modified.loc[df_modified['Age'] > 30, 'Salary'] = df_modified.loc[df_modified['Age'] > 30, 'Salary'] + 5000
df_modified[['Name', 'Age', 'Salary']]

---
<a name='7'></a>
## **7. Cleaning & Aggregation**

### Handling Missing Values

First, let's create a DataFrame with missing values.

In [ ]:
# Create a DataFrame with missing values
data_with_nan = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [25, np.nan, 35, 28, np.nan],
    'City': ['New York', 'Paris', np.nan, 'Tokyo', 'Berlin'],
    'Salary': [70000, 80000, 75000, np.nan, 85000]
}

df_nan = pd.DataFrame(data_with_nan)
df_nan

DataFrame with missing values:
      Name   Age      City   Salary
0    Alice  25.0  New York  70000.0
1      Bob   NaN     Paris  80000.0
2  Charlie  35.0       NaN  75000.0
3    Diana  28.0     Tokyo      NaN
4      Eve   NaN    Berlin  85000.0

In [ ]:
# Check for missing values

df_nan.isnull().sum()

In [ ]:
# Drop rows with any missing values

df_nan.dropna()

In [ ]:
# Fill missing values with a specific value

df_filled = df_nan.fillna({'Age': df_nan['Age'].mean(), 'City': 'Unknown', 'Salary': 0})
df_filled

### Basic Aggregation with .groupby()

GroupBy allows you to split data into groups and apply functions to each group.

In [45]:
# Group by Department and calculate mean salary

df_employees.groupby('Department')['Salary'].mean()

Department
Engineering     99333.333333
HR              72000.000000
Management     120000.000000
Marketing       75000.000000
Name: Salary, dtype: float64

In [46]:
# Multiple aggregations

df_employees.groupby('Department')['Salary'].agg(['mean', 'min', 'max', 'count'])

                      mean     min     max  count
Department
Engineering   99333.333333   95000  105000      3
HR            72000.000000   72000   72000      1
Management   120000.000000  120000  120000      1
Marketing     75000.000000   68000   82000      2

In [47]:
# Group by and aggregate multiple columns

df_employees.groupby('Department')[['Age', 'Salary']].mean()

                   Age         Salary
Department
Engineering  32.333333   99333.333333
HR           29.000000   72000.000000
Management   42.000000  120000.000000
Marketing    30.000000   75000.000000

---
<a name='8'></a>
## **8. Advanced Topics (Important!)**

### Combining DataFrames

In [49]:
# Create sample DataFrames for merging
df1 = pd.DataFrame({
    'EmployeeID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Department': ['IT', 'HR', 'IT', 'Sales']
})

df2 = pd.DataFrame({
    'EmployeeID': [1, 2, 3, 5],
    'Salary': [70000, 65000, 75000, 68000],
    'Years': [3, 5, 2, 4]
})

In [50]:
df1

   EmployeeID     Name Department
0           1    Alice         IT
1           2      Bob         HR
2           3  Charlie         IT
3           4    Diana      Sales

In [51]:
df2

   EmployeeID  Salary  Years
0           1   70000      3
1           2   65000      5
2           3   75000      2
3           5   68000      4

In [57]:
# Inner join to keep only matching records

merged_inner = pd.merge(df1, df2, on='EmployeeID', how='inner')
merged_inner

   EmployeeID     Name Department  Salary  Years
0           1    Alice         IT   70000      3
1           2      Bob         HR   65000      5
2           3  Charlie         IT   75000      2

In [58]:
# Outer join to keep all records

merged_outer = pd.merge(df1, df2, on='EmployeeID', how='outer')
merged_outer

   EmployeeID     Name Department   Salary  Years
0           1    Alice         IT  70000.0    3.0
1           2      Bob         HR  65000.0    5.0
2           3  Charlie         IT  75000.0    2.0
3           4    Diana      Sales      NaN    NaN
4           5      NaN        NaN  68000.0    4.0

In [ ]:
# Concatenate DataFrames vertically
df_a = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df_b = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})

concatenated = pd.concat([df_a, df_b], ignore_index=True)
concatenated

   A  B
0  1  3
1  2  4
2  5  7
3  6  8

### Applying Custom Functions

Use `.apply()` and `.map()` to apply custom transformations.

In [60]:
# Apply a function to a column
def salary_category(salary):
    if salary < 70000:
        return 'Low'
    elif salary < 90000:
        return 'Medium'
    else:
        return 'High'

In [61]:
df_employees['Salary_Category'] = df_employees['Salary'].apply(salary_category)
df_employees[['Name', 'Salary', 'Salary_Category']]

            Name  Salary Salary_Category
0     John Smith   95000            High
1  Sarah Johnson   82000          Medium
2  Michael Brown   98000            High
3    Emily Davis   72000          Medium
4   David Wilson  120000            High
5  Lisa Anderson   68000             Low
6   James Taylor  105000            High

In [ ]:
# # Using lambda functions
# df_employees['Name_Length'] = df_employees['Name'].apply(lambda x: len(x))
# df_employees[['Name', 'Name_Length']]

            Name  Name_Length
0     John Smith           10
1  Sarah Johnson           13
2  Michael Brown           13
3    Emily Davis           11
4   David Wilson           12
5  Lisa Anderson           13
6   James Taylor           12

In [63]:
# Using .map() with a dictionary
department_mapping = {
    'Engineering': 'Tech',
    'Marketing': 'Business',
    'HR': 'Support',
    'Management': 'Leadership'
}

df_employees['Department_Category'] = df_employees['Department'].map(department_mapping)
df_employees[['Name', 'Department', 'Department_Category']]

            Name   Department Department_Category
0     John Smith  Engineering                Tech
1  Sarah Johnson    Marketing            Business
2  Michael Brown  Engineering                Tech
3    Emily Davis           HR             Support
4   David Wilson   Management          Leadership
5  Lisa Anderson    Marketing            Business
6   James Taylor  Engineering                Tech

### Reshaping Data with .pivot_table()

Pivot tables help reorganize and summarize data.

In [64]:
# Create sample sales data
sales_data = {
    'Date': ['2024-01', '2024-01', '2024-02', '2024-02', '2024-01', '2024-02'],
    'Product': ['Laptop', 'Mouse', 'Laptop', 'Mouse', 'Keyboard', 'Keyboard'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South'],
    'Sales': [1200, 25, 1500, 30, 75, 80]
}

df_sales = pd.DataFrame(sales_data)
df_sales

      Date   Product Region  Sales
0  2024-01    Laptop  North   1200
1  2024-01     Mouse  South     25
2  2024-02    Laptop  North   1500
3  2024-02     Mouse  South     30
4  2024-01  Keyboard  North     75
5  2024-02  Keyboard  South     80

In [ ]:
# Create a pivot table
pivot = df_sales.pivot_table(
    values = 'Sales',
    index = 'Product',
    columns = 'Region',
    aggfunc = 'sum',
    fill_value = 0
)
pivot

Region    North  South
Product
Keyboard     75     80
Laptop     2700      0
Mouse         0     55

### Encoding Categorical Variables with pd.get_dummies()

`pd.get_dummies()` converts categorical variables into dummy/indicator variables (one-hot encoding). This is essential for machine learning algorithms that require numerical input.

In [ ]:
# Basic usage: Convert a single categorical column
pd.get_dummies(df_employees['Department'])

In [ ]:
# Add dummy columns to the DataFrame with a prefix
df_with_dummies = pd.get_dummies(df_employees, columns=['Department'], prefix='Dept')
df_with_dummies.head()

In [ ]:
# Use drop_first=True to avoid multicollinearity (useful for ML models)
df_encoded = pd.get_dummies(df_employees, columns=['Department'], drop_first=True)
df_encoded.head()

In [ ]:
# Encode multiple categorical columns at once
df_multi_encoded = pd.get_dummies(df_employees, columns=['Department', 'Salary_Category'], prefix=['Dept', 'Sal'])
df_multi_encoded.head()

### Working with Text Data (.str accessor)

The `.str` accessor provides string methods for Series.

In [66]:
# String Uppercase
df_employees['Name'].str.upper()

0       JOHN SMITH
1    SARAH JOHNSON
2    MICHAEL BROWN
3      EMILY DAVIS
4     DAVID WILSON
5    LISA ANDERSON
6     JAMES TAYLOR
Name: Name, dtype: object

In [ ]:
# String contains
df_employees[df_employees['Name'].str.contains('son', case=False)]

,Name,Age,Department,Salary,JoinDate,Salary_Category,Name_Length,Department_Category
1,Sarah Johnson,34,Marketing,82000,2019-05-22,Medium,13,Business
4,David Wilson,42,Management,120000,2015-07-19,High,12,Leadership
5,Lisa Anderson,26,Marketing,68000,2022-01-25,Low,13,Business

In [68]:
# String split
df_employees['Name'].str.split().str[0]

0       John
1      Sarah
2    Michael
3      Emily
4      David
5       Lisa
6      James
Name: Name, dtype: object

In [69]:
# String replace
df_employees['Name'].str.replace('John', 'Jonathan')

0       Jonathan Smith
1    Sarah Jonathanson
2        Michael Brown
3          Emily Davis
4         David Wilson
5        Lisa Anderson
6         James Taylor
Name: Name, dtype: object

### Working with Datetime

Pandas has powerful datetime functionality for time series analysis.

In [70]:
df_employees

,Name,Age,Department,Salary,JoinDate,Salary_Category,Name_Length,Department_Category
0,John Smith,28,Engineering,95000,2020-01-15,High,10,Tech
1,Sarah Johnson,34,Marketing,82000,2019-05-22,Medium,13,Business
2,Michael Brown,31,Engineering,98000,2018-11-10,High,13,Tech
3,Emily Davis,29,HR,72000,2021-03-08,Medium,11,Support
4,David Wilson,42,Management,120000,2015-07-19,High,12,Leadership
5,Lisa Anderson,26,Marketing,68000,2022-01-25,Low,13,Business
6,James Taylor,38,Engineering,105000,2017-09-14,High,12,Tech

In [71]:
df_employees.dtypes

Name                   object
Age                     int64
Department             object
Salary                  int64
JoinDate               object
Salary_Category        object
Name_Length             int64
Department_Category    object
dtype: object

In [72]:
# Convert string to datetime
df_employees['JoinDate'] = pd.to_datetime(df_employees['JoinDate'])

In [73]:
df_employees.dtypes

Name                           object
Age                             int64
Department                     object
Salary                          int64
JoinDate               datetime64[ns]
Salary_Category                object
Name_Length                     int64
Department_Category            object
dtype: object

In [74]:
# Extract date components
df_employees['JoinYear'] = df_employees['JoinDate'].dt.year
df_employees['JoinMonth'] = df_employees['JoinDate'].dt.month
df_employees['JoinDayOfWeek'] = df_employees['JoinDate'].dt.day_name()

df_employees

,Name,Age,Department,Salary,JoinDate,Salary_Category,Name_Length,Department_Category,JoinYear,JoinMonth,JoinDayOfWeek
0,John Smith,28,Engineering,95000,2020-01-15,High,10,Tech,2020,1,Wednesday
1,Sarah Johnson,34,Marketing,82000,2019-05-22,Medium,13,Business,2019,5,Wednesday
2,Michael Brown,31,Engineering,98000,2018-11-10,High,13,Tech,2018,11,Saturday
3,Emily Davis,29,HR,72000,2021-03-08,Medium,11,Support,2021,3,Monday
4,David Wilson,42,Management,120000,2015-07-19,High,12,Leadership,2015,7,Sunday
5,Lisa Anderson,26,Marketing,68000,2022-01-25,Low,13,Business,2022,1,Tuesday
6,James Taylor,38,Engineering,105000,2017-09-14,High,12,Tech,2017,9,Thursday

In [76]:
# Calculate time differences
df_employees['DaysEmployed'] = (pd.Timestamp.now() - df_employees['JoinDate']).dt.days

df_employees.sort_values('DaysEmployed', ascending=False)

,Name,Age,Department,Salary,JoinDate,Salary_Category,Name_Length,Department_Category,JoinYear,JoinMonth,JoinDayOfWeek,DaysEmployed
4,David Wilson,42,Management,120000,2015-07-19,High,12,Leadership,2015,7,Sunday,3801
6,James Taylor,38,Engineering,105000,2017-09-14,High,12,Tech,2017,9,Thursday,3013
2,Michael Brown,31,Engineering,98000,2018-11-10,High,13,Tech,2018,11,Saturday,2591
1,Sarah Johnson,34,Marketing,82000,2019-05-22,Medium,13,Business,2019,5,Wednesday,2398
0,John Smith,28,Engineering,95000,2020-01-15,High,10,Tech,2020,1,Wednesday,2160
3,Emily Davis,29,HR,72000,2021-03-08,Medium,11,Support,2021,3,Monday,1742
5,Lisa Anderson,26,Marketing,68000,2022-01-25,Low,13,Business,2022,1,Tuesday,1419

---

## **ðŸŽ‰ Conclusion**

Congratulations! You've completed this comprehensive Pandas tutorial covering:

âœ… **Basics**: Series, DataFrames, importing data  
âœ… **Inspection**: head(), tail(), info(), describe()  
âœ… **Selection**: Column selection, .iloc, .loc  
âœ… **Filtering**: Boolean masks, multiple conditions, .isin()  
âœ… **Modification**: Creating columns, updating values  
âœ… **Cleaning**: Handling missing values, groupby aggregations  
âœ… **Advanced**: Merging, applying functions, pivot tables, string operations, datetime

### Next Steps:

1. **Practice**: Work with real datasets (Kaggle, UCI Machine Learning Repository)
2. **Visualization**: Learn Matplotlib or Seaborn for data visualization
3. **Performance**: Explore Pandas performance optimization techniques
4. **Advanced**: Study time series, multi-indexing, and custom aggregations

### Useful Resources:

- Official Documentation: https://pandas.pydata.org/docs/
- 10 Minutes to Pandas: https://pandas.pydata.org/docs/user_guide/10min.html

Happy Data Analysis! ðŸ“ŠðŸ¼